Catalogs/ДополнительныеКолонкиСписковЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ДополнительныеКолонкиСписковЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыЗначений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПутиКЗначениямДополнительныхКолонокЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПутиКЗначениямДополнительныхКолонокЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПутьКЗначению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеКолонкиСписковЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьЗаполненияДополнительныхКолонокЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОчередьЗаполненияДополнительныхКолонокЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеКолонкиСписковЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ДополнительныеКолонкиСписковЗадач/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИдентификаторПоддержкиСтрокой = Объект.ИдентификаторПоддержки;
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ИдентификаторПоддержкиСтрокой)
		И ИдентификаторПоддержкиСтрокой <> Строка(ТекущийОбъект.ИдентификаторПоддержки) Тогда
		ТекущийОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
	КонецЕсли;
	
	ТекущийОбъект.ТипыЗначений = ТипыОтмеченныхРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьПутиКЗначениямДополнительныхКолонокЗадач(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИдентификаторПоддержкиСтрокой) Тогда
		Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Введен некорректный уникальный идентификатор'"),,
				"ИдентификаторПоддержкиСтрокой",, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеПоискаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ПолеПоиска = Текст;
	ОтключитьОбработчикОжидания("Подключаемый_ВыполнитьПоискВСпискеПолей");
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьПоискВСпискеПолей", 0.3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаОчистка(Элемент, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("Подключаемый_ВыполнитьПоискВСпискеПолей");
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьПоискВСпискеПолей", 0.3, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РеквизитыДокументов

&НаКлиенте
Процедура РеквизитыДокументовОтметкаПриИзменении(Элемент)
	
	ТекущийРеквизит = Элементы.РеквизитыДокументов.ТекущиеДанные;
	
	ТипДокумента = ТекущийРеквизит.ПолучитьРодителя();
	
	СтрокаДокумент = РеквизитыДокументовВсе.НайтиПоИдентификатору(
		ИдентификаторыВсехСтрок[ТипДокумента.ИдентификаторДокумента]);
	
	ОтметитьРеквизитВСтрокеОсновнойТаблицы(СтрокаДокумент, ТекущийРеквизит);
	
	ТипДокумента.Представление = СтрокаДокумент.Представление;
	
	Если ТекущийРеквизит.Отметка Тогда
		// сброс остальных отметок для этого типа документа
		Для Каждого ПодчиненныйРеквизит Из ТипДокумента.ПолучитьЭлементы() Цикл
			Если ПодчиненныйРеквизит.Отметка И ПодчиненныйРеквизит <> ТекущийРеквизит Тогда
				ПодчиненныйРеквизит.Отметка = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОтборРеквизитов = 1 И НЕ ТекущийРеквизит.Отметка Тогда
		ИдентификаторыВидимыхСтрок.Удалить(
			ИдентификаторыВидимыхСтрок.НайтиПоЗначению(ТипДокумента.ПолучитьИдентификатор()));
		РеквизитыДокументов.ПолучитьЭлементы().Удалить(ТипДокумента);
	ИначеЕсли ОтборРеквизитов = 2 И ТекущийРеквизит.Отметка Тогда
		ИдентификаторыВидимыхСтрок.Удалить(
			ИдентификаторыВидимыхСтрок.НайтиПоЗначению(ТипДокумента.ПолучитьИдентификатор()));
		РеквизитыДокументов.ПолучитьЭлементы().Удалить(ТипДокумента);
	КонецЕсли;
	
	Если ТипДокумента.ОтсутствуетВМетаданных ИЛИ ТекущийРеквизит.ОтсутствуетВМетаданных Тогда
		УправлениеВидимостьюГруппыОтсутствующиеРеквизиты(ЭтотОбъект);
	КонецЕсли;
	
	ТипДокумента.ОтсутствуетВМетаданных = ТекущийРеквизит.ОтсутствуетВМетаданных;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Развернуть(Команда)
	
	РазвернутьДеревоРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	
	Для Каждого ИдентиФикатор Из ИдентификаторыВидимыхСтрок Цикл
		Элементы.РеквизитыДокументов.Свернуть(ИдентиФикатор.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьРеквизитыСИменем(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаИмениРеквизита", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", НСтр("ru = 'Имя реквизита'"), 50);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаИмениРеквизита(Строка, Параметры) Экспорт
	
	Если Строка = Неопределено ИЛИ ПустаяСтрока(Строка) Тогда
		Возврат;
	КонецЕсли;
	
	ОтметитьРеквизитыНаСервере(Строка);
	
	Модифицированность = Истина;
	
	Если СтрДлина(ПолеПоиска) > 1 Тогда
		РазвернутьДеревоРеквизитов();
	КонецЕсли;
	
	УправлениеВидимостьюГруппыОтсутствующиеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиСоВсехРеквизитов(Команда)
	
	СнятьОтметкуРеквизитовНаСервере();
	
	ОтобратьПодходящиеРеквизиты();
	
	Если СтрДлина(ПолеПоиска) > 1 Тогда
		РазвернутьДеревоРеквизитов();
	КонецЕсли;
	
	УправлениеВидимостьюГруппыОтсутствующиеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	
	Если ОтборРеквизитов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтборРеквизитов = 0;
	
	ОтобратьПодходящиеРеквизиты();
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
	Если СтрДлина(ПолеПоиска) > 1 Тогда
		РазвернутьДеревоРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗаполненные(Команда)
	
	Если ОтборРеквизитов = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ОтборРеквизитов = 1;
	
	ОтобратьПодходящиеРеквизиты();
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
	Если СтрДлина(ПолеПоиска) > 1 Тогда
		РазвернутьДеревоРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНезаполненные(Команда)
	
	Если ОтборРеквизитов = 2 Тогда
		Возврат;
	КонецЕсли;
	
	ОтборРеквизитов = 2;
	
	ОтобратьПодходящиеРеквизиты();
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
	Если СтрДлина(ПолеПоиска) > 1 Тогда
		РазвернутьДеревоРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтсутствующиеРеквизиты(Команда)
	
	Для Каждого ТекСтрока Из РеквизитыДокументовВсе.ПолучитьЭлементы() Цикл
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			Если ТекПодстрока.ОтсутствуетВМетаданных Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В метаданных документа ""%1"" отсутствует реквизит ""%2""'"),
					ТекСтрока.ИдентификаторДокумента,
					ТекПодстрока.Представление);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьСписокРеквизитов();
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРеквизитов()
	
	ПутиКРеквизитам = ТекущиеПутиКЗначениям();
	
	РеквизитыДокументовВсе.ПолучитьЭлементы().Очистить();
	
	Дерево = РеквизитФормыВЗначение("РеквизитыДокументовВсе");
	
	ТипыПредметов = Метаданные.ОпределяемыеТипы.ПредметПроцессаОбработкиДокументов.Тип.Типы();
	
	ДопустимыеТипыРеквизитов = Метаданные.РегистрыСведений.ЗначенияДополнительныхКолонокЗадач.Ресурсы.Значение.Тип;
	
	Для Каждого Тип Из ТипыПредметов Цикл
		
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(Тип);
		ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип);
		СинонимНаименованияОбъекта = МетаданныеОбъекта.Синоним;
		
		СтрокаДокумент = Дерево.Строки.Добавить();
		СтрокаДокумент.ИдентификаторДокумента = ИдентификаторДокумента;
		СтрокаДокумент.СинонимДокумента = СинонимНаименованияОбъекта;
		СтрокаДокумент.Представление = СинонимНаименованияОбъекта;
		СтрокаДокумент.ПредставлениеДляПоиска = НРег(СтрокаДокумент.Представление);
		
		ОтмеченныйРеквизит = ПутиКРеквизитам[ИдентификаторДокумента];
		РеквизитЕстьВМетаданных = Ложь;
		
		МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
		
		Для Каждого Реквизит Из МетаданныеДокумента.СтандартныеРеквизиты Цикл
			
			Если ПроцессыОбработкиДокументов.НепроверяемыйРеквизит(Реквизит.Имя) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаРеквизит = СтрокаДокумент.Строки.Добавить();
			СтрокаРеквизит.ИмяРеквизита = Реквизит.Имя;
			СтрокаРеквизит.Представление = Реквизит.Имя;
			СтрокаРеквизит.ПредставлениеДляПоиска = НРег(СтрокаРеквизит.Представление);
			СтрокаРеквизит.Тип = Реквизит.Тип;
			
			Если Реквизит.Имя = ОтмеченныйРеквизит Тогда
				РеквизитЕстьВМетаданных = Истина;
				СтрокаРеквизит.Отметка = Истина;
				СтрокаДокумент.Представление = СтрокаДокумент.СинонимДокумента + " -> " + СтрокаРеквизит.Представление;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Реквизит Из МетаданныеДокумента.Реквизиты Цикл
			
			Если ПроцессыОбработкиДокументов.НепроверяемыйРеквизит(Реквизит.Имя) Тогда
				Продолжить;
			КонецЕсли;
			
			ТипПодходит = Ложь;
			Для Каждого ТипРеквизита Из Реквизит.Тип.Типы() Цикл
				Если ДопустимыеТипыРеквизитов.СодержитТип(ТипРеквизита) Тогда
					ТипПодходит = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не ТипПодходит Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаРеквизит = СтрокаДокумент.Строки.Добавить();
			СтрокаРеквизит.ИмяРеквизита = Реквизит.Имя;
			Если ПустаяСтрока(Реквизит.Синоним) Тогда
				СтрокаРеквизит.Представление = Реквизит.Имя;
			Иначе
				СтрокаРеквизит.Представление = Реквизит.Синоним + " ["+Реквизит.Имя+"]";
			КонецЕсли;
			СтрокаРеквизит.ПредставлениеДляПоиска = НРег(СтрокаРеквизит.Представление);
			СтрокаРеквизит.Тип = Реквизит.Тип;
			
			Если Реквизит.Имя = ОтмеченныйРеквизит Тогда
				РеквизитЕстьВМетаданных = Истина;
				СтрокаРеквизит.Отметка = Истина;
				СтрокаДокумент.Представление = СтрокаДокумент.СинонимДокумента + " -> " + СтрокаРеквизит.Представление;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОтмеченныйРеквизит <> Неопределено И НЕ РеквизитЕстьВМетаданных Тогда
			СтрокаРеквизит = СтрокаДокумент.Строки.Добавить();
			СтрокаРеквизит.ИмяРеквизита = ОтмеченныйРеквизит;
			СтрокаРеквизит.Представление = ОтмеченныйРеквизит;
			СтрокаРеквизит.ПредставлениеДляПоиска = НРег(ОтмеченныйРеквизит);
			СтрокаРеквизит.Отметка = Истина;
			СтрокаРеквизит.ОтсутствуетВМетаданных = Истина;
			СтрокаДокумент.Представление = СтрокаДокумент.СинонимДокумента + " -> " + СтрокаРеквизит.Представление;
			СтрокаДокумент.ОтсутствуетВМетаданных = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Дерево.Строки.Сортировать("Представление");
	
	КоличествоЭлементовКоллекции = Дерево.Строки.Количество();
	Для Индекс = 1 По КоличествоЭлементовКоллекции Цикл
		ОбратныйИндекс = КоличествоЭлементовКоллекции - Индекс;
		СтрокаДокумент = Дерево.Строки[ОбратныйИндекс];
		Если Лев(СтрокаДокумент.Представление, 1) = "(" Тогда
			Дерево.Строки.Сдвинуть(ОбратныйИндекс, Индекс - 1);
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "РеквизитыДокументовВсе");
	
	ЗначениеВРеквизитФормы(Дерево, "РеквизитыДокументов");
	
	Идентификаторы = Новый Соответствие;
	ИдентификаторыМассив = Новый Массив;
	Для Каждого ТекСтрока Из РеквизитыДокументов.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки = ТекСтрока.ПолучитьИдентификатор();
		Идентификаторы.Вставить(ТекСтрока.ИдентификаторДокумента, ИдентификаторСтроки);
		ИдентификаторыМассив.Добавить(ИдентификаторСтроки);
	КонецЦикла;
	ИдентификаторыВсехСтрок = Новый ФиксированноеСоответствие(Идентификаторы);
	ИдентификаторыВидимыхСтрок.ЗагрузитьЗначения(ИдентификаторыМассив);
	
КонецПроцедуры

&НаСервере
Функция ТекущиеПутиКЗначениям()
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПутиКЗначениямДополнительныхКолонокЗадач.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ПутиКЗначениямДополнительныхКолонокЗадач.ПутьКЗначению КАК ПутьКЗначению
	|ИЗ
	|	РегистрСведений.ПутиКЗначениямДополнительныхКолонокЗадач КАК ПутиКЗначениямДополнительныхКолонокЗадач
	|ГДЕ
	|	ПутиКЗначениямДополнительныхКолонокЗадач.Колонка = &Колонка
	|	И ПутиКЗначениямДополнительныхКолонокЗадач.ПутьКЗначению <> """"";
	
	Запрос.УстановитьПараметр("Колонка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИдентификаторДокумента, Выборка.ПутьКЗначению);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЭлементамиФормы(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ПоказатьВсе", "Пометка", Форма.ОтборРеквизитов = 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ПоказатьЗаполненные", "Пометка", Форма.ОтборРеквизитов = 1);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ПоказатьНезаполненные", "Пометка", Форма.ОтборРеквизитов = 2);
	
	КартинкаОтбора = БиблиотекаКартинок.ЗатенитьФлажки;
	Если Форма.ОтборРеквизитов = 1 Тогда
		КартинкаОтбора = БиблиотекаКартинок.УстановитьФлажки;
	ИначеЕсли Форма.ОтборРеквизитов = 2 Тогда
		КартинкаОтбора = БиблиотекаКартинок.СнятьФлажки;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГруппаОтбор", "Картинка", КартинкаОтбора);
	
	УправлениеВидимостьюГруппыОтсутствующиеРеквизиты(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюГруппыОтсутствующиеРеквизиты(Форма)
	
	ОтмеченыОтсутствующиеРеквизиты = Ложь;
	
	Для Каждого ТекСтрока Из Форма.РеквизитыДокументовВсе.ПолучитьЭлементы() Цикл
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			Если ТекПодстрока.ОтсутствуетВМетаданных И ТекПодстрока.Отметка Тогда
				ОтмеченыОтсутствующиеРеквизиты = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ОтмеченыОтсутствующиеРеквизиты Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГруппаОтстутствующиеРеквизиты", "Видимость", ОтмеченыОтсутствующиеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПоискВСпискеПолей()
	
	ОтобратьПодходящиеРеквизиты();
	
	Если СтрДлина(ПолеПоиска) > 1 Тогда
		РазвернутьДеревоРеквизитов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьПодходящиеРеквизиты()
	
	ТекстПоиска = НРег(ПолеПоиска);
	
	Дерево = РеквизитФормыВЗначение("РеквизитыДокументовВсе");
	
	Если СтрДлина(ТекстПоиска) < 2 И ОтборРеквизитов = 0 Тогда
		ЗначениеВРеквизитФормы(Дерево, "РеквизитыДокументов");
	Иначе
		РеквизитыДокументов.ПолучитьЭлементы().Очистить();
		ДеревоОтбор = РеквизитФормыВЗначение("РеквизитыДокументов");
		Для Каждого СтрокаДокумент Из Дерево.Строки Цикл
			СтрокаДокументОтбор = ДеревоОтбор.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДокументОтбор, СтрокаДокумент);
			ЕстьОтмеченныйРеквизит = Ложь;
			Для Каждого СтрокаРеквизит Из СтрокаДокумент.Строки Цикл
				ЕстьОтмеченныйРеквизит = ЕстьОтмеченныйРеквизит ИЛИ СтрокаРеквизит.Отметка;
				Если СтрДлина(ТекстПоиска) < 2 ИЛИ СтрНайти(СтрокаРеквизит.ПредставлениеДляПоиска, ТекстПоиска) > 0 Тогда
					ЗаполнитьЗначенияСвойств(СтрокаДокументОтбор.Строки.Добавить(), СтрокаРеквизит);
				КонецЕсли;
			КонецЦикла;
			Если СтрДлина(ТекстПоиска) > 1 И СтрНайти(СтрокаДокумент.ПредставлениеДляПоиска, ТекстПоиска) = 0
				И СтрокаДокументОтбор.Строки.Количество() = 0 Тогда
				ДеревоОтбор.Строки.Удалить(СтрокаДокументОтбор);
			ИначеЕсли ОтборРеквизитов = 1 И НЕ ЕстьОтмеченныйРеквизит Тогда
				ДеревоОтбор.Строки.Удалить(СтрокаДокументОтбор);
			ИначеЕсли ОтборРеквизитов = 2 И ЕстьОтмеченныйРеквизит Тогда
				ДеревоОтбор.Строки.Удалить(СтрокаДокументОтбор);
			КонецЕсли;
		КонецЦикла;
		ЗначениеВРеквизитФормы(ДеревоОтбор, "РеквизитыДокументов");
	КонецЕсли;
	
	ИдентиФикаторы = Новый Массив;
	Для Каждого ТекСтрока Из РеквизитыДокументов.ПолучитьЭлементы() Цикл
		ИдентиФикаторы.Добавить(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;
	ИдентификаторыВидимыхСтрок.ЗагрузитьЗначения(ИдентиФикаторы);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоРеквизитов()
	
	Для Каждого ИдентиФикатор Из ИдентификаторыВидимыхСтрок Цикл
		Элементы.РеквизитыДокументов.Развернуть(ИдентиФикатор.Значение, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПутиКЗначениямДополнительныхКолонокЗадач(ТекущийОбъект)
	
	// После записи настройки необходимо определить типы документов,
	// которые следует обработать в регламентном задании
	СтарыеПутиКЗначениям = ТекущиеПутиКЗначениям();
	
	НовыеПутиКЗначениям = Новый Соответствие;
	
	Дерево = РеквизитФормыВЗначение("РеквизитыДокументовВсе");
	
	// перезапись настройки по текущей колонке
	НаборЗаписей = РегистрыСведений.ПутиКЗначениямДополнительныхКолонокЗадач.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Колонка.Установить(ТекущийОбъект.Ссылка);
	
	Для Каждого СтрокаДокумент Из Дерево.Строки Цикл
		Для Каждого СтрокаРеквизит Из СтрокаДокумент.Строки Цикл
			Если СтрокаРеквизит.Отметка Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Колонка = ТекущийОбъект.Ссылка;
				Запись.ИдентификаторДокумента = СтрокаДокумент.ИдентификаторДокумента;
				Запись.ПутьКЗначению = СтрокаРеквизит.ИмяРеквизита;
				НовыеПутиКЗначениям.Вставить(СтрокаДокумент.ИдентификаторДокумента, СтрокаРеквизит.ИмяРеквизита);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	// регистрация типов документов для обработки регламентным заданием:
	// необходимо обработать типы с добавленной, измененной или удаленной настройкой
	ТипыДокументовДляОбработки = Новый Массив;
	
	Для Каждого НовыйПутьКЗначению Из НовыеПутиКЗначениям Цикл
		СтарыйПутьКЗначению = СтарыеПутиКЗначениям[НовыйПутьКЗначению.Ключ];
		Если СтарыйПутьКЗначению <> Неопределено Тогда
			Если СтарыйПутьКЗначению <> НовыйПутьКЗначению.Значение Тогда
				ТипыДокументовДляОбработки.Добавить(НовыйПутьКЗначению.Ключ);
			КонецЕсли;
			СтарыеПутиКЗначениям.Удалить(НовыйПутьКЗначению.Ключ);
		Иначе
			ТипыДокументовДляОбработки.Добавить(НовыйПутьКЗначению.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтарыйПутьКЗначению Из СтарыеПутиКЗначениям Цикл
		ТипыДокументовДляОбработки.Добавить(СтарыйПутьКЗначению.Ключ);
	КонецЦикла;
	
	ПроцессыОбработкиДокументов.ЗаблокироватьРегистрОчередьЗаполненияДополнительныхКолонокЗадач(
		ТекущийОбъект.Ссылка, ТипыДокументовДляОбработки);
	
	Для Каждого ТипДокументаДляОбработки Из ТипыДокументовДляОбработки Цикл
		
		МенеджерЗаписи = РегистрыСведений.ОчередьЗаполненияДополнительныхКолонокЗадач.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Колонка = ТекущийОбъект.Ссылка;
		МенеджерЗаписи.ИдентификаторДокумента = ТипДокументаДляОбработки;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	// Включение регламентного задания
	Если ТипыДокументовДляОбработки.Количество() > 0 Тогда
		ПроцессыОбработкиДокументов.ВключитьЗаполнениеДополнительныхКолонокЗадач();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтметитьРеквизитВСтрокеОсновнойТаблицы(СтрокаДокумент, ТекущийРеквизит)
	
	Если ТекущийРеквизит.Отметка Тогда
		// сброс остальных отметок для этого типа документа
		Для Каждого СтрокаРеквизит Из СтрокаДокумент.ПолучитьЭлементы() Цикл
			Если СтрокаРеквизит.ИмяРеквизита = ТекущийРеквизит.ИмяРеквизита Тогда
				СтрокаРеквизит.Отметка = Истина;
			ИначеЕсли СтрокаРеквизит.Отметка Тогда
				СтрокаРеквизит.Отметка = Ложь;
			КонецЕсли;
		КонецЦикла;
		СтрокаДокумент.Представление = СтрокаДокумент.СинонимДокумента + " -> " + ТекущийРеквизит.Представление;
	Иначе
		Для Каждого СтрокаРеквизит Из СтрокаДокумент.ПолучитьЭлементы() Цикл
			СтрокаРеквизит.Отметка = Ложь;
		КонецЦикла;
		СтрокаДокумент.Представление = СтрокаДокумент.СинонимДокумента;
	КонецЕсли;
	
	СтрокаДокумент.ОтсутствуетВМетаданных = ТекущийРеквизит.ОтсутствуетВМетаданных;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьРеквизитыНаСервере(ИмяРеквизита)
	
	Дерево = РеквизитФормыВЗначение("РеквизитыДокументов");
	
	ПодходящиеСтроки = Дерево.Строки.НайтиСтроки(Новый Структура("ИмяРеквизита", ИмяРеквизита), Истина);
	Для Каждого ПодходящаяСтрока Из ПодходящиеСтроки Цикл
		
		ТипДокумента = ПодходящаяСтрока.Родитель;
		
		Для Каждого Сосед Из ТипДокумента.Строки Цикл
			Сосед.Отметка = Ложь;
		КонецЦикла;
		
		ПодходящаяСтрока.Отметка = Истина;
		
		СтрокаДокумент = РеквизитыДокументовВсе.НайтиПоИдентификатору(
			ИдентификаторыВсехСтрок[ТипДокумента.ИдентификаторДокумента]);
		
		ОтметитьРеквизитВСтрокеОсновнойТаблицы(СтрокаДокумент, ПодходящаяСтрока);
		
		ТипДокумента.Представление = СтрокаДокумент.Представление;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "РеквизитыДокументов");
	
	ОтобратьПодходящиеРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура СнятьОтметкуРеквизитовНаСервере()
	
	Дерево = РеквизитФормыВЗначение("РеквизитыДокументов");
	
	ПодходящиеСтроки = Дерево.Строки.НайтиСтроки(Новый Структура("Отметка", Истина), Истина);
	Для Каждого ПодходящаяСтрока Из ПодходящиеСтроки Цикл
		
		ТипДокумента = ПодходящаяСтрока.Родитель;
		
		ПодходящаяСтрока.Отметка = Ложь;
		ПодходящаяСтрока.ОтсутствуетВМетаданных = Ложь;
		
		СтрокаДокумент = РеквизитыДокументовВсе.НайтиПоИдентификатору(
			ИдентификаторыВсехСтрок[ТипДокумента.ИдентификаторДокумента]);
		
		ОтметитьРеквизитВСтрокеОсновнойТаблицы(СтрокаДокумент, ПодходящаяСтрока);
		
		ТипДокумента.Представление = СтрокаДокумент.Представление;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "РеквизитыДокументов");
	
	ОтобратьПодходящиеРеквизиты();
	
КонецПроцедуры

&НаСервере
Функция ТипыОтмеченныхРеквизитов()
	
	Типы = Новый Соответствие;
	Для Каждого СтрокаДокумент Из РеквизитыДокументовВсе.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаРеквизит Из СтрокаДокумент.ПолучитьЭлементы() Цикл
			Если НЕ СтрокаРеквизит.Отметка Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого Тип Из СтрокаРеквизит.Тип.Типы() Цикл
				Типы.Вставить(Тип);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	МассивТипов = Новый Массив;
	Для Каждого Тип Из Типы Цикл
		МассивТипов.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип.Ключ));
	КонецЦикла;
	
	Возврат СтрСоединить(МассивТипов, ",");
	
КонецФункции

#КонецОбласти
